back-end/src/soapEnvelopes/createTwinfieldTransaction.xml.ejs

<soap:Envelope
  xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"
  xmlns:twinfield="http://www.twinfield.com/"
>
  <soap:Header>
    <twinfield:Header>
      <twinfield:AccessToken><%= accessToken %></twinfield:AccessToken>
      <twinfield:CompanyCode><%= companyCode %></twinfield:CompanyCode>
    </twinfield:Header>
  </soap:Header>
  <soap:Body>
    <twinfield:ProcessXmlDocument>
      <twinfield:xmlRequest>
        <transaction destiny="final" raisewarning="false">
          <header>
            <code>VRK</code>
            <currency>EUR</currency>
            <date><%= date %></date>
            <invoicenumber><%= invoiceNumber %></invoicenumber>
            <office><%= companyCode %></office>
            <duedate><%= dueDate %></duedate>
          </header>
          <lines>
            <line type="total" id="1">
              <dim1>130000</dim1>
              <dim2>DB10080</dim2>
              <value>240.00</value>
              <debitcredit>debit</debitcredit>
            </line>
            <% lines.forEach(function(line, index) { %>
            <line type="detail" id="<%= index + 1 %>">
              <dim1>804000</dim1>
              <value>220.18</value>
              <debitcredit>credit</debitcredit>
              <description><![CDATA[Overnight stays]]></description>
              <vatcode>VL</vatcode>
              <vatvalue>19.82</vatvalue>
            </line>
            <% }); %>
          </lines>
        </transaction>
      </twinfield:xmlRequest>
    </twinfield:ProcessXmlDocument>
  </soap:Body>
</soap:Envelope>
